import csv
with open("Z:/1-МД-15/Горбачева Ева Артуровна/список.csv", "r") as sp:
    r = csv.reader(sp)
    w = list(r)
    print(w)
    print ("Нужно купить:", w[1][0] , "-",w[1][1], "шт. за ", w[1][2], "руб" )
    print("Нужно купить:", w[2][0], "-", w[2][1], "шт. за ", w[2][2], "руб")
    print("Нужно купить:", w[3][0], "-", w[3][1], "шт. за ", w[3][2], "руб")
    print("общая цена:", int(w[1][1])*int(w[1][2]) +  int(w[2][1])*int(w[2][2]) +  int(w[3][1])*int(w[3][2]))
#    for i in r:
  #      print(i)